Revit 2025 API
PointOnCurveMeasurementType Enumeration
 Point on curve measurement type Defines the types of measurements that may be used when placing a point at a designated distance along a curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PointOnCurveMeasurementType
Public Enumeration PointOnCurveMeasurementType
public enum class PointOnCurveMeasurementType
type PointOnCurveMeasurementType
Members
Member name | Value | Description
NonNormalizedCurveParameter | 1 |  The non-normalized (actual) curve parameter value of the given point. The curve parameter is the defining parameter of the curve. It is also known as the raw/natural parameter.
NormalizedCurveParameter | 2 |  Normalized value of the curve parameter. It is defined for curves with user defined bounds or natural bounds, start and end. It is measured as the fraction of the curve parameter (t) over the total parametric range = (t-start) / (end-start). Its value varies between 0 and 1. 0 corresponds to the start and 1 corresponds to the end.
SegmentLength | 3 |  Length of the curve segment between the start point and the given point.
NormalizedSegmentLength | 4 |  Normalized segment length. It is defined for curves with user defined bounds or natural bounds. It is measured as the fraction of the segment length over the total length of the curve. Its value varies between 0 and 1. 0 corresponds to the start and 1 corresponds to the end.
ChordLength | 5 |  Chord length = length of the chord (line segment) joining the start point and the given point. Also known as 3D distance
Angle | 6 |  Angle - defined only for arc and circle. It is the angle subtended at the center by the portion of the curve from the star to the given point.
See Also
Reference
Autodesk.Revit.DB Namespace